HeleShaw_Caso3/HeleShaw3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.05; // deltaX = xDir/xMesh / U 


adjustTimeStep yes;
maxCo 0.8;              // NOT WORKING
maxDeltaT 1e-1;  

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    inletFlow
    {
        type            surfaceFieldValue;
        functionObjectLibs ("libfieldFunctionObjects.so");
        log             true;
        writeFields     false; // Opcional, mas evita confusões
        valueOutput     true;
        operation       areaIntegrate;
        regionType      patch;
        name            outlet;
        fields          (U);
    }

    CourantNumber    // NOT WORKING
    {
        type            CourantNo;
        functionObjectLibs ("libutilityFunctionObjects.so");
        valueOutput     true;
        log             true;
        writeControl   timeStep;
        writeInterval  1;
    }
}



// ************************************************************************* //
